compressiblePhaseChangeInterFoam_v2206/run/thermosyphon3_3D_FR/fluid/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 281.35;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    internalFluidWalls
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     fluidThermo;
    }

    "(top|bottom)" 
    {
        type            zeroGradient;
        value           $internalField;
    }
    
    "symmetry.*"
    {
        type            symmetryPlane;
        value           $internalField;
    }
}


// ************************************************************************* //
