compressiblePhaseChangeInterFoam_v2206/run/thermosyphon3_3D_FR/fluid/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    internalFluidWalls
    {
        type            noSlip;
    }

    "(top|bottom)" 
    {        
        type            noSlip;
    }
    
    "symmetry.*"
    {
        type            symmetryPlane;
        value           $internalField;
    }
}


// ************************************************************************* //
