compressiblePhaseChangeInterFoam_v2206/run/thermosyphon3_3D_FR/fluid/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     compressiblePhaseChangeInterFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         300;

deltaT          0.0003;

writeControl    adjustableRunTime;

writeInterval   5;

purgeWrite      1;

writeFormat     ascii;

writePrecision  16;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           1;
maxAlphaCo      1;


libs        (utilityFunctionObjects);

DebugSwitches
{
    //fvPatchField        1;
    //fvPatchScalarField  1;
    //mappedPatchBase 1;
    //syncObjects     1;
    //regIOobject     2;
}

functions
{
    syncObjects
    {
        type        syncObjects;
        libs        (utilityFunctionObjects);
    }
#include    "FOvolumeAverage"
}


// ************************************************************************* //
